http-benchmarks/output/run-httpserv_lwt-10000-1000.txt
Running 1m test @ http://localhost:8080
  24 threads and 1000 connections
  Thread calibration: mean lat.: 1.108ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.056ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.053ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.559ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.096ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.140ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.134ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.531ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.104ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.162ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.209ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.158ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.179ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.163ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.120ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.171ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.124ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.119ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.098ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.097ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.070ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.076ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.102ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.094ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09ms    0.94ms  17.44ms   93.77%
    Req/Sec   440.12    492.51     4.55k    94.45%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.97ms
 75.000%    1.31ms
 90.000%    1.71ms
 99.000%    5.28ms
 99.900%   11.12ms
 99.990%   14.28ms
 99.999%   17.26ms
100.000%   17.45ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.046     0.000000            1         1.00
       0.385     0.100000        49968         1.11
       0.565     0.200000        99741         1.25
       0.713     0.300000       149559         1.43
       0.845     0.400000       199259         1.67
       0.970     0.500000       249206         2.00
       1.031     0.550000       274117         2.22
       1.091     0.600000       298797         2.50
       1.154     0.650000       323746         2.86
       1.228     0.700000       348680         3.33
       1.313     0.750000       373680         4.00
       1.361     0.775000       386066         4.44
       1.414     0.800000       398418         5.00
       1.473     0.825000       410768         5.71
       1.541     0.850000       423330         6.67
       1.617     0.875000       435711         8.00
       1.661     0.887500       441880         8.89
       1.713     0.900000       448212        10.00
       1.770     0.912500       454364        11.43
       1.837     0.925000       460584        13.33
       1.920     0.937500       466812        16.00
       1.971     0.943750       469918        17.78
       2.031     0.950000       473003        20.00
       2.103     0.956250       476134        22.86
       2.191     0.962500       479239        26.67
       2.305     0.968750       482332        32.00
       2.379     0.971875       483884        35.56
       2.469     0.975000       485440        40.00
       2.593     0.978125       487009        45.71
       2.787     0.981250       488560        53.33
       3.263     0.984375       490109        64.00
       3.737     0.985938       490888        71.11
       4.211     0.987500       491667        80.00
       4.863     0.989062       492442        91.43
       5.587     0.990625       493224       106.67
       6.507     0.992188       493998       128.00
       6.903     0.992969       494389       142.22
       7.387     0.993750       494778       160.00
       7.903     0.994531       495167       182.86
       8.439     0.995313       495559       213.33
       8.959     0.996094       495943       256.00
       9.231     0.996484       496142       284.44
       9.487     0.996875       496337       320.00
       9.743     0.997266       496530       365.71
      10.015     0.997656       496721       426.67
      10.247     0.998047       496917       512.00
      10.375     0.998242       497012       568.89
      10.543     0.998437       497111       640.00
      10.735     0.998633       497214       731.43
      10.959     0.998828       497311       853.33
      11.135     0.999023       497403      1024.00
      11.231     0.999121       497450      1137.78
      11.359     0.999219       497502      1280.00
      11.511     0.999316       497548      1462.86
      11.663     0.999414       497598      1706.67
      11.839     0.999512       497644      2048.00
      11.983     0.999561       497669      2275.56
      12.103     0.999609       497693      2560.00
      12.207     0.999658       497718      2925.71
      12.423     0.999707       497743      3413.33
      12.807     0.999756       497766      4096.00
      12.903     0.999780       497778      4551.11
      13.039     0.999805       497790      5120.00
      13.183     0.999829       497802      5851.43
      13.471     0.999854       497816      6826.67
      13.703     0.999878       497827      8192.00
      13.863     0.999890       497833      9102.22
      14.311     0.999902       497841     10240.00
      14.399     0.999915       497845     11702.86
      14.599     0.999927       497851     13653.33
      14.863     0.999939       497857     16384.00
      15.079     0.999945       497860     18204.44
      15.383     0.999951       497863     20480.00
      15.495     0.999957       497866     23405.71
      15.599     0.999963       497869     27306.67
      15.871     0.999969       497872     32768.00
      16.175     0.999973       497874     36408.89
      16.191     0.999976       497875     40960.00
      16.639     0.999979       497877     46811.43
      16.815     0.999982       497878     54613.33
      17.135     0.999985       497880     65536.00
      17.151     0.999986       497881     72817.78
      17.151     0.999988       497881     81920.00
      17.263     0.999989       497882     93622.86
      17.311     0.999991       497883    109226.67
      17.327     0.999992       497884    131072.00
      17.327     0.999993       497884    145635.56
      17.327     0.999994       497884    163840.00
      17.343     0.999995       497885    187245.71
      17.343     0.999995       497885    218453.33
      17.407     0.999996       497886    262144.00
      17.407     0.999997       497886    291271.11
      17.407     0.999997       497886    327680.00
      17.407     0.999997       497886    374491.43
      17.407     0.999998       497886    436906.67
      17.455     0.999998       497887    524288.00
      17.455     1.000000       497887          inf
#[Mean    =        1.092, StdDeviation   =        0.943]
#[Max     =       17.440, Total count    =       497887]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  598623 requests in 1.00m, 1.22GB read
Requests/sec:   9969.66
Transfer/sec:     20.82MB

JSON Output:
{
	"requests": 598623,
	"duration_in_microseconds": 60044472.00,
	"bytes": 1310984370,
	"requests_per_sec": 9969.66,
	"bytes_transfer_per_sec": 21833556.47,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 970
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 1313
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 1713
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 5275
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 11119
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 14279
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 17263
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 17455
		}
	]
}